jspark311/ManuvrPlatforms/ESP32/src/WiFi.cpp
/*
File:   WiFi.cpp
Author: J. Ian Lindsay
Date:   2025.12.27

This file contains a reusable wrapper for the ESP32's radio features.
*/

#include "../ESP32.h"


#define ESP32RADIO_FSM_WAYPOINT_DEPTH  12

/*******************************************************************************
*      _______.___________.    ___   .___________. __    ______     _______.
*     /       |           |   /   \  |           ||  |  /      |   /       |
*    |   (----`---|  |----`  /  ^  \ `---|  |----`|  | |  ,----'  |   (----`
*     \   \       |  |      /  /_\  \    |  |     |  | |  |        \   \
* .----)   |      |  |     /  _____  \   |  |     |  | |  `----.----)   |
* |_______/       |__|    /__/     \__\  |__|     |__|  \______|_______/
*
* Static members and initializers should be located here.
*******************************************************************************/
TaskHandle_t _thread_id_svc = nullptr;   // Deprecated. Retained for link hygiene.

wifi_ap_record_t ESP32Radio::_scan_list_ap[ESP32RADIO_SCAN_RESULTS] = {0};
uint16_t ESP32Radio::_scan_list_count = 0;
uint16_t ESP32Radio::_scan_total_count = 0;


const EnumDef<ESP32RadioState> _STATE_LIST[] = {
  { ESP32RadioState::UNINIT,        "UNINIT"},
  { ESP32RadioState::PRE_INIT,      "PRE_INIT"},
  { ESP32RadioState::RESETTING,     "RESETTING"},
  { ESP32RadioState::INIT,          "INIT"},
  { ESP32RadioState::SCANNING,      "SCANNING"},
  { ESP32RadioState::PROMISCUOUS,   "PROMISCUOUS"},
  { ESP32RadioState::CONNECTING,    "CONNECTING"},
  { ESP32RadioState::CONNECTED,     "CONNECTED"},
  { ESP32RadioState::DISCONNECTING, "DISCONNECTING"},
  { ESP32RadioState::DISCONNECTED,  "DISCONNECTED"},
  { ESP32RadioState::SLEEPING,      "SLEEPING"},
  { ESP32RadioState::WAKING,        "WAKING"},
  { ESP32RadioState::FAULT,         "FAULT"},
  { ESP32RadioState::INVALID,       "INVALID", (ENUM_WRAPPER_FLAG_CATCHALL)}  // FSM hygiene.
};
const EnumDefList<ESP32RadioState> _FSM_STATES(&_STATE_LIST[0], (sizeof(_STATE_LIST) / sizeof(_STATE_LIST[0])), "ESP32RadioState");


// Static storage, no heap. Compiler will know by call-graph if the memory needs
//   to be set aside and linked.
ESP32Radio* ESP32Radio::getInstance() {
  static uint8_t _radio_obj_buf[sizeof(ESP32Radio)] __attribute__((aligned(alignof(ESP32Radio))));
  static ESP32Radio* _inst = nullptr;
  if (nullptr == _inst) {
    _inst = new (_radio_obj_buf) ESP32Radio();
  }
  return _inst;
}


/*******************************************************************************
* Event handlers: signal-only (no driver calls)
*******************************************************************************/
void wifi_event_handler(void* arg, esp_event_base_t event_base, int32_t event_id, void* event_data) {
  static const char* const TAG = "wifi_event_handler";
  ESP32Radio* radio = (ESP32Radio*) arg;
  if (nullptr == radio) return;

  switch (event_id) {
    case WIFI_EVENT_STA_START:
      // Signal only. FSM decides when to call esp_wifi_connect().
      radio->_mb_set_wifi_started(true);
      break;

    case WIFI_EVENT_STA_CONNECTED:
      radio->_mb_set_sta_connected(true);
      break;

    case WIFI_EVENT_STA_DISCONNECTED:
    { // Signal only. FSM decides when/if to reconnect.
      wifi_event_sta_disconnected_t* ev = (wifi_event_sta_disconnected_t*) event_data;
      radio->_mb_set_sta_connected(false);  // Treat as authoritative routability loss immediately.
      radio->_mb_set_ip4_valid(false);
      radio->_mb_set_ip4_addr(0);
      if (nullptr != ev) {
        radio->_mb_set_disconnect_reason(ev->reason);
      }
    }
    break;

    case WIFI_EVENT_SCAN_DONE:
      radio->_mb_set_scan_done(true);
      break;

    default:
      //c3p_log(LOG_LEV_DEBUG, TAG, "WIFI event: %d", event_id);
      break;
  }
}


void ip_event_handler(void* arg, esp_event_base_t event_base, int32_t event_id, void* event_data) {
  static const char* const TAG = "ip_event_handler";
  ESP32Radio* radio = (ESP32Radio*) arg;
  if (nullptr == radio) return;

  switch (event_id) {
    case IP_EVENT_STA_GOT_IP: {
      ip_event_got_ip_t* event = (ip_event_got_ip_t*) event_data;
      //c3p_log(LOG_LEV_INFO, TAG, "got ip:" IPSTR, IP2STR(&event->ip_info.ip));
      radio->_mb_set_ip4_addr(event->ip_info.ip.addr);
      radio->_mb_set_ip4_valid(true);
      break;
    }
    case IP_EVENT_STA_LOST_IP:
      //c3p_log(LOG_LEV_INFO, TAG, "lost ip");
      radio->_mb_set_ip4_valid(false);
      radio->_mb_set_ip4_addr(0);
      break;

    default:
      //c3p_log(LOG_LEV_DEBUG, TAG, "IP event: %d", event_id);
      break;
  }
}



/*
* Constructor
*/
ESP32Radio::ESP32Radio() :
  StateMachine<ESP32RadioState>("ESP32Radio-FSM", &_FSM_STATES, ESP32RadioState::UNINIT, ESP32RADIO_FSM_WAYPOINT_DEPTH),
  _reconnect_timer(0),
  _flags(0)
{
  // Event-loop -> poll() mailboxes.
  _mb_wifi_started   = false;
  _mb_sta_connected  = false;
  _mb_ip4_valid      = false;
  _mb_scan_done      = false;
  _mb_ip4_addr       = 0;

  // Poll/FSM-owned latched state.
  _wifi_started      = false;
  _sta_connected     = false;
  _ip4_valid         = false;
  _ip4_addr          = 0;

  _scan_done_latched = false;
}


/*
* Destructor
*/
ESP32Radio::~ESP32Radio() {
  esp_netif_deinit();
  esp_wifi_deinit();
}



int8_t ESP32Radio::init() {
  int8_t ret = 0;
  _fsm_set_route(3, ESP32RadioState::PRE_INIT, ESP32RadioState::INIT, ESP32RadioState::DISCONNECTED);
  return ret;
}



int8_t ESP32Radio::serialize_ap(const uint8_t AP_IDX, StringBuilder* output) {
  int8_t ret = -1;
  return ret;
}



/*******************************************************************************
* Mailbox helpers (safe for event-loop task context)
*******************************************************************************/
void ESP32Radio::_mb_set_wifi_started(const bool v) { _mb_wifi_started  = v; }
void ESP32Radio::_mb_set_sta_connected(const bool v){ _mb_sta_connected = v; }
void ESP32Radio::_mb_set_ip4_valid(const bool v)    { _mb_ip4_valid     = v; }
void ESP32Radio::_mb_set_scan_done(const bool v)    { _mb_scan_done     = v; }
void ESP32Radio::_mb_set_ip4_addr(const uint32_t a) { _mb_ip4_addr      = a; }

void ESP32Radio::_mb_set_disconnect_reason(const uint16_t r) {
  _mb_disc_reason = r;
  _mb_disc_reason_valid = true;
}


