jspark311/ManuvrPlatforms/ESP32/src/WiFi.cpp
/*******************************************************************************
* Public query API (for sibling FSMs like MQTT)
*******************************************************************************/
bool ESP32Radio::linkUp() {  return _sta_connected;  }
bool ESP32Radio::hasIP()  {  return _ip4_valid;      }
uint32_t ESP32Radio::ip4() { return _ip4_addr;       }





/*******************************************************************************
* Wifi utilities
*******************************************************************************/

void ESP32Radio::autoconnect(bool v) {
  if (v ^ _flags.value(ESP32RADIO_FLAG_AUTOCONNECT)) {
    _reconnect_backoff_ms = 5000;
    _reconnect_timer.reset(0);   // Allow immediate connect next time.
    _flags.set(ESP32RADIO_FLAG_AUTOCONNECT, v);
  }
}


/* Initialize Wi-Fi as sta and set scan method */
int8_t ESP32Radio::wifi_scan() {
  int8_t ret = -1;
  if (initialized() && _fsm_is_stable()) {
    ret = _fsm_append_route(2, ESP32RadioState::SCANNING, currentState());
  }
  return ret;
}


/**
*
*
* @return PollResult
*/
FAST_FUNC PollResult ESP32Radio::poll() {
  // Consume mailboxes (event loop task -> deterministic super-loop).
  // NOTE: We deliberately do NOT clear _mb_scan_done here. The FSM consumes that edge.
  _wifi_started  = _mb_wifi_started;
  _sta_connected = _mb_sta_connected;
  _ip4_valid     = _mb_ip4_valid;
  _ip4_addr      = (_ip4_valid ? _mb_ip4_addr : 0);

  // Edge detection: once set, it stays latched until the FSM consumes it.
  if (_mb_scan_done) {
    _scan_done_latched = true;
  }

  if (_mb_disc_reason_valid) {
    _last_disc_reason = _mb_disc_reason;
    _mb_disc_reason_valid = false;

    // Strict policy: if the AP explicitly says auth failed, stop reconnecting.
    if (WIFI_REASON_AUTH_FAIL == _last_disc_reason) {
      _flags.set(ESP32RADIO_FLAG_AUTH_REFUSED, true);
      _flags.set(ESP32RADIO_FLAG_AUTOCONNECT, false);
    }
  }

  return ((0 == _fsm_poll()) ? PollResult::NO_ACTION : PollResult::ACTION);
}


/**
* Called in idle time by the firmware to prod the driver's state machine forward.
* Considers the current driver state, and decides whether or not to advance the
*   driver's state machine.
*
* @return  1 on state shift
*          0 on no action
*         -1 on error
*/
FAST_FUNC int8_t ESP32Radio::_fsm_poll() {
  int8_t ret = 0;
  bool fsm_advance = false;
  switch (currentState()) {
    // Exit conditions: The next state is PRE_INIT.
    case ESP32RadioState::UNINIT:
      fsm_advance = _fsm_is_next_pos(ESP32RadioState::PRE_INIT);
      break;

    // Exit conditions: The threading, net stack and event loop are all marshalled.
    case ESP32RadioState::PRE_INIT:
      fsm_advance = _pre_init_complete();
      break;

    // Exit conditions:
    case ESP32RadioState::RESETTING:
      break;

    // Exit conditions:
    case ESP32RadioState::INIT:
      fsm_advance = initialized();
      break;

    // Exit conditions: The radio event handler has reported the scan finished.
    case ESP32RadioState::SCANNING:
      fsm_advance = _scan_done_latched;
      if (fsm_advance) {
        _collect_scan_results();
        // Consume scan completion edge here (FSM owns it).
        _scan_done_latched = false;
        _mb_scan_done      = false;
      }
      break;

    // Exit conditions:
    case ESP32RadioState::PROMISCUOUS:
      fsm_advance = !_fsm_is_stable();
      break;

    // Exit conditions:
    case ESP32RadioState::CONNECTING:
      // We consider CONNECTED to mean "associated". IP may arrive later.
      if (_fsm_is_stable() && _sta_connected) {
        _fsm_append_state(ESP32RadioState::CONNECTED);
      }
      fsm_advance = !_fsm_is_stable();
      break;

    // Exit conditions:
    case ESP32RadioState::CONNECTED:
      if (_fsm_is_stable()) {
        if (!_sta_connected) {
          fsm_advance = (0 == _fsm_append_state(ESP32RadioState::DISCONNECTED));
        }
        else {
          // Update AP record opportunistically.
          esp_wifi_sta_get_ap_info(&_current_ap);
        }
      }
      fsm_advance = !_fsm_is_stable();
      break;

    // Exit conditions:
    case ESP32RadioState::DISCONNECTING:
      fsm_advance = !_sta_connected;
      break;

    // Exit conditions:
    case ESP32RadioState::DISCONNECTED:
      if (_fsm_is_stable()) {
        if (_sta_connected) {
          _fsm_append_state(ESP32RadioState::CONNECTED);
        }
        else {
          if (_flags.value(ESP32RADIO_FLAG_AUTOCONNECT) &&
              !_flags.value(ESP32RADIO_FLAG_AUTH_REFUSED) &&
              _wifi_started &&
              _reconnect_timer.expired() &&
              !_flags.value(ESP32RADIO_FLAG_CONNECT_ACTIVE)) {

            // Schedule next connect attempt window only if we successfully queue CONNECTING.
            _flags.set(ESP32RADIO_FLAG_CONNECT_ACTIVE, (0 == _fsm_append_state(ESP32RadioState::CONNECTING)));
          }
        }
      }
      fsm_advance = !_fsm_is_stable();
      break;

    // Exit conditions:
    case ESP32RadioState::SLEEPING:
      break;

    // Exit conditions:
    case ESP32RadioState::WAKING:
      break;

    // We can't step our way out of this mess. We need to call init().
    case ESP32RadioState::FAULT:     // If the driver is in a FAULT, do nothing.
      break;
    default:   // Can't exit from an unknown state.
      ret = -1;
      break;
  }

  // If the current state's exit criteria is met, we advance the FSM.
  if (fsm_advance & (-1 != ret)) {
    ret = (0 == _fsm_advance()) ? 1 : 0;
  }
  return ret;
}


/**
* Takes actions appropriate for entry into the given state, and sets the current
*   FSM position if successful. Records the existing state as having been the
*   prior state.
*
* @param The FSM code to test.
* @return 0 on success, -1 otherwise.
*/
FAST_FUNC int8_t ESP32Radio::_fsm_set_position(ESP32RadioState new_state) {
  int8_t ret = -1;
  const ESP32RadioState CURRENT_STATE = currentState();
  if (_fsm_is_waiting()) return ret;
  bool state_entry_success = false;
  switch (new_state) {
    // Entry conditions: Never.
    case ESP32RadioState::UNINIT:
      _set_fault("Tried to _fsm_set_position(UNINIT)");
      break;

    // Entry conditions: Unconditional. If we're here, we are clear to proceed.
    case ESP32RadioState::PRE_INIT:
      if (!_flags.value(ESP32RADIO_FLAG_NETIF_INIT)) {
        _flags.set(ESP32RADIO_FLAG_NETIF_INIT, (ESP_OK == esp_netif_init()));
      }
      if (!_flags.value(ESP32RADIO_FLAG_EVENT_LOOP_CREATED)) {
        switch (esp_event_loop_create_default()) {
          case ESP_OK:
          case ESP_ERR_INVALID_STATE:
            _flags.set(ESP32RADIO_FLAG_EVENT_LOOP_CREATED);
            ESP_ERROR_CHECK(esp_event_handler_instance_register(WIFI_EVENT, ESP_EVENT_ANY_ID, &wifi_event_handler, this, &_handler_any_id));
            ESP_ERROR_CHECK(esp_event_handler_instance_register(IP_EVENT,   ESP_EVENT_ANY_ID, &ip_event_handler,   this, &_handler_ip_any_id));
            break;
          default:
            _set_fault("Unable to create default event loop.");
            break;
        }
      }

      ESP32Radio::_scan_list_count  = 0;
      ESP32Radio::_scan_total_count = 0;
      _mb_scan_done      = false;
      _scan_done_latched = false;
      memset(ESP32Radio::_scan_list_ap, 0, sizeof(ESP32Radio::_scan_list_ap));  // Wipe the record of nearby APs.
      memset(&_current_ap, 0, sizeof(_current_ap));  // Wipe out current AP.
      // Clear network state.
      _mb_sta_connected = false;
      _mb_ip4_valid     = false;
      _mb_ip4_addr      = 0;
      state_entry_success = true;
      break;


